app/views/drinks/show.html.erb

<%= render @drink.mixers %>
<% @drink.mixers.each do |mixer| %>
---
SELECT "mixers".* FROM "mixers" WHERE "mixers"."drink_id" = ?  [["drink_id", 2]]

<%= render @drink.liquors %>
<% @drink.liquors.each do |liquor| %>
---
SELECT "liquors".* FROM "liquors" WHERE "liquors"."drink_id" = ?  [["drink_id", 1]]