app/controllers/drinks_controller.rb

INSERT INTO "drinks" ("name", "alcoholPerVolume", "flavor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "TestDrink"], ["alcoholPerVolume", 0.2], ["flavor", 0], ["created_at", "2018-11-18 02:01:20.788071"], ["updated_at", "2018-11-18 02:01:20.788071"]]
---
    def create

        @drink = Drink.new(drink_params)

        if @drink.save

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @drink = Drink.find(params[:id])

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "drinks" SET "alcoholPerVolume" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["alcoholPerVolume", 0.11], ["updated_at", "2018-11-18 00:05:36.512203"], ["id", 1]]
---
    def update
        @drink = Drink.find(params[:id])
            if @drink.update(drink_params)

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 4]]
---
    def destroy
         @drink = Drink.find(params[:id])
         @drink.destroy