app/controllers/liquors_controller.rb

        def create
       @drink = Drink.find(params[:drink_id])
       @liquor = @drink.liquors.create(liquor_params)
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "liquors" ("name", "drink_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Vodka"], ["drink_id", 2], ["created_at", "2018-11-18 02:04:01.586306"], ["updated_at", "2018-11-18 02:04:01.586306"]]

        def destroy
         @drink = Drink.find(params[:drink_id])
         @liquor = @drink.liquors.find(params[:id])
         @liquor.destroy
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "liquors".* FROM "liquors" WHERE "liquors"."drink_id" = ? AND "liquors"."id" = ? LIMIT ?  [["drink_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "liquors" WHERE "liquors"."id" = ?  [["id", 2]]