app/controllers/mixers_controller.rb

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "mixers" ("name", "drink_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Orange Juice"], ["drink_id", 3], ["created_at", "2018-11-18 02:10:49.612578"], ["updated_at", "2018-11-18 02:10:49.612578"]]
---
    def create
       @drink = Drink.find(params[:drink_id])
       @mixer = @drink.mixers.create(mixer_params)